---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim
source: html/0cde177d-ec80-71b5-0275-5737ec927926.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim Property

Cannot label multi-dimensions to one reporting parameter.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReportingParamAlreadyLabelsToAnotherDim { get; }
```